Service discovery design update
